# Rebar Get End Treatment Type Id Method

Source: https://www.revitapidocs.com/2026/3521d0c8-5746-6dde-4839-3e9a14dbd93e.htm

---

| Rebar Get End Treatment Type Id Method |
| --- |

Get the id of the EndTreatmentType that is applied to the rebar.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId GetEndTreatmentTypeId(
	int end
)
```

```
Public Function GetEndTreatmentTypeId (
	end As Integer
) As ElementId
```

```
public:
ElementId^ GetEndTreatmentTypeId(
	int end
)
```

```
member GetEndTreatmentTypeId :
        end : int -> ElementId
```

#### Parameters

end Int32
:   0 for the start end treatment, 1 for the end end treatment.

#### Return Value

ElementId
The id of a EndTreatmentType, or invalidElementId if the rebar has
 no end treatment at the specified end. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | end must be 0 or 1\. |

See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace